<?php
$a = 5;
$b = 10;


/* เพิ่มค่า */

echo "ค่าเริ่มต้น ".$a. "<br>"; //5

echo "เพิ่มค่าให้ตัวแปร a แบบ prefix = ".(++$a) ."<br>";
echo "ค่าล่าสุดของ a = ".$a."<br>";
echo "<hr>";

$a = 5;
echo "ค่าเริ่มต้น ".$a. "<br>"; //5
echo "เพิ่มค่าให้ตัวแปร a แบบ postfix = ".($a++) ."<br>";;
echo "ค่าล่าสุดของ a = ".$a."<br>";
echo "<hr>";

$b = 10;
echo "ค่าเริ่มต้น ".$b. "<br>"; //5
echo "ลดค่าให้ตัวแปร b แบบ pretfix = ".(--$b) ."<br>";;
echo "ค่าล่าสุดของ b = ".$b."<br>";
echo "<hr>";

$b = 10;
echo "ค่าเริ่มต้น ".$b. "<br>"; //5
echo "ลดค่าให้ตัวแปร b แบบ postfix = ".($b--) ."<br>";;
echo "ค่าล่าสุดของ b = ".$b."<br>";

?>