<?php
$a = 400;
$b = "500";

var_dump($a == $b); //เท่ากันไหม
echo"<br>";
var_dump($a != $b);
echo"<br>";
var_dump($a === $b); //เหมือนกันไหม
echo"<br>";
var_dump($a !== $b); //ไม่เหมือนกันไหม
echo"<br>";
//echo "var_dump = ". ($a == $b);

var_dump($a > $b);
echo"<br>";


$c = $a>$b;
$d = $a<$b;
$e = $a<>$b;
$f = $a>=$b;
$g = $a<=$b;
$h = $a<=>$b; //ส่งคำตอบออกมาเป็นตัวเลข ค่าที่ได้ ถ้า a<b = -1, a=b=0, a>b=1
echo "ผลการเปรียบเทียบค่า > = " .($c)."<br>";
echo "ผลการเปรียบเทียบค่า <= " .($d)."<br>";
echo "ผลการเปรียบเทียบค่า <> " .($e)."<br>";
echo "ผลการเปรียบเทียบค่า >= " .($f)."<br>";
echo "ผลการเปรียบเทียบค่า <= " .($g)."<br>";
echo "ผลการเปรียบเทียบค่า <= " .($g)."<br>";
echo "ผลการเปรียบเทียบค่า <=> " .($h)."<br>";

var_dump($a > $b);
var_dump($a<=>$b);
echo"<br>";
?>